```
Terraform will perform the following actions:

  # google_cloudbuild_trigger.security will be created
  + resource "google_cloudbuild_trigger" "security" {
      + create_time     = (known after apply)
      + filename        = "cloudbuild/security.yaml"
      + id              = (known after apply)
      + location        = "us-central1"
      + name            = "security"
      + project         = "chatparser"
      + service_account = "projects/chatparser/serviceAccounts/cloudbuild-sa-dev@chatparser.iam.gserviceaccount.com"
      + trigger_id      = (known after apply)

      + approval_config (known after apply)

      + repository_event_config {
          + repository = "projects/chatparser/locations/us-central1/connections/bnekolny/repositories/bnekolny-chatparser"

          + push {
              + branch = ".*"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```